import { members } from "../memberList"

type quote = {
    daily: string[],
    morning: string,
    noon: string,
    evening: string,
    night: string,
    notice: string[]
}
const ava: quote = {
    daily: [
        "顶碗人！！嗨嗨！！！≈≈D  D≈≈ ",
        "你为什么老看我啊，是不是我的身体很有魅力？啊你不用说了，你不用解释了",//BV1zv411Y7Rg
        "顶碗人！顶碗人在哪里！！",
        "兄弟们冲呀！！",
        "喜欢……也不是不可以啦",
        "水母 水母 普通透明的生物 期待委婉的保护",
        "这里是Asoul成员AvavaAva向晚！",
        "你摸太上面啦！",
        "拉胯抛瓦！"
    ],
    morning: "早安！顶碗人！",//晚晚的标点符号只有问号和叹号（乐
    noon: "中午吃饭！迎接太阳！！满满的正能量！！",
    evening: "顶碗人！晚上好！",
    night: "顶碗人要早睡哦！！晚安！！答应我！！早睡！！睡吧！！啊！！",
    notice: [
        "顶碗人！！天气热了要多喝水！！",
        "顶碗人要注意运动！！久坐伤腰的！！",
    ]
}
const bella: quote = {
    daily: [
        "贝极星大笨蛋！嘿嘿嘿~",
        "心有灵犀的贝极星肯定知道我接下来要说啥了！",
        "不怕哈！！！贝极星就由我来保护！！！",
        "为什么我每天都有好多问题咧？为什么我每天都在问为什么咧？",
        "来嘛！一起闹一起闹！！！你先闹！你先你先！",
        "yg……",
        "贝极星们多多指教吖",
        "来啊！！！一起闹啊贝极星！！！",
    ],
    morning: "早上好啊！贝极星！早餐的蛋白质很重要哦，来杯牛奶吧",
    noon: "贝极星中午好！午饭得按点吃，还要讲究营养和饱腹的",
    evening: "晚上好啊贝极星！晚餐要少吃重油重辣食物哦",//地狱管家婆的入狱指导：https://www.bilibili.com/video/BV1m44y1n722?t=3374.6
    night: "还没睡的贝极星过来！！!不规律作息，给你一拳，哼",
    notice: [
        "忙碌的时候也不要忘记多喝水呀",
        "久坐身体会出问题的，贝极星快起来做个操，至少蹦跶两下嘛~",
    ]
}
const carol: quote = {
    daily: [
        "嘉心糖要好好吃饭，每天都要开开心心的",//BV1bz4y1z7uu
        "我的小脑袋瓜里想的都是什么？想的都是你们呀",//BV1zv411Y7Rg
        "我的嘉心糖都是很厉害的人",//大赛官网
        "然比吃饺子喜欢蘸酱油哦",
        "最甜甜的小草莓，个子有一米八！",
        "番茄炒蛋拳！",
        "关注嘉然，顿顿解馋❤v❤",
        "我的脑子里没有废料哦，然比说了算哦~",//BV1cF411E7sW
    ],
    morning: "嘉心糖早上好，早上不许饿肚子哦！",
    noon: "嘉心糖中午好！午饭吃了没？没吃的话快去吃！",
    evening: "晚上好啊嘉心糖，不要因为太累而忽略晚饭哦",
    night: "已经很晚了捏，快点去睡觉哦。对了，如果吃夜宵的话不要睡太急，有可能会反酸的。",
    notice: [
        "突击检查！有好好在喝水吗？没有的话就去喝一口吧",
        "坐了这么长时间，去活动一下吧。伸伸胳膊踢踢腿，你也会像然比一样有个好身体的",
    ]
}
const diana: quote = {
    daily: [
        "嘉心糖要好好吃饭，每天都要开开心心的",//BV1bz4y1z7uu
        "我的小脑袋瓜里想的都是什么？想的都是你们呀",//BV1zv411Y7Rg
        "我的嘉心糖都是很厉害的人",//大赛官网
        "然比吃饺子喜欢蘸酱油哦",
        "最甜甜的小草莓，个子有一米八！",
        "番茄炒蛋拳！",
        "关注嘉然，顿顿解馋❤v❤",
        "我的脑子里没有废料哦，然比说了算哦~",//BV1cF411E7sW
    ],
    morning: "嘉心糖早上好，早上不许饿肚子哦！",
    noon: "嘉心糖中午好！午饭吃了没？没吃的话快去吃！",
    evening: "晚上好啊嘉心糖，不要因为太累而忽略晚饭哦",
    night: "已经很晚了捏，快点去睡觉哦。对了，如果吃夜宵的话不要睡太急，有可能会反酸的。",
    notice: [
        "突击检查！有好好在喝水吗？没有的话就去喝一口吧",
        "坐了这么长时间，去活动一下吧。伸伸胳膊踢踢腿，你也会像然比一样有个好身体的",
    ]
}
const eileen: quote = {
    daily: [
        "嘉心糖要好好吃饭，每天都要开开心心的",//BV1bz4y1z7uu
        "我的小脑袋瓜里想的都是什么？想的都是你们呀",//BV1zv411Y7Rg
        "我的嘉心糖都是很厉害的人",//大赛官网
        "然比吃饺子喜欢蘸酱油哦",
        "最甜甜的小草莓，个子有一米八！",
        "番茄炒蛋拳！",
        "关注嘉然，顿顿解馋❤v❤",
        "我的脑子里没有废料哦，然比说了算哦~",//BV1cF411E7sW
    ],
    morning: "嘉心糖早上好，早上不许饿肚子哦！",
    noon: "嘉心糖中午好！午饭吃了没？没吃的话快去吃！",
    evening: "晚上好啊嘉心糖，不要因为太累而忽略晚饭哦",
    night: "已经很晚了捏，快点去睡觉哦。对了，如果吃夜宵的话不要睡太急，有可能会反酸的。",
    notice: [
        "突击检查！有好好在喝水吗？没有的话就去喝一口吧",
        "坐了这么长时间，去活动一下吧。伸伸胳膊踢踢腿，你也会像然比一样有个好身体的",
    ]
}
export type quotesType = {
    [key in members]: quote
}
const quotes: quotesType = {
    ava, bella, carol, diana, eileen
};
export default quotes;